---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelCurve
source: html/23e953ff-dabf-eb06-059d-7c0db29f514e.htm
---
# ModelCurve Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.